import { Telegraf, Markup } from "telegraf";
class messageBot {
  urlWebsite = "http://VapeHorizonOPT.ru";
  msgSupport = "@VapeHorizonOPT2";
  hiMsg =
    "Привет! Этот бот создан специально для сотрудников Vape Horizont.\nЕсли вы один из нас, получите ID вашего аккаунта и сообщите его админам.";
  startKeyboard = [["🌐 Наш сайт", "🎧 Тех. Поддержка"]];

  msgOurWebsite = `Мы — Vape Horizon, новый, но уже уверенный игрок на оптовом рынке. \n\nНаша цель — дать вам не просто товар, а стабильную выгоду и скорость.\n\nВ ассортименте всё, что нужно:\n✅ Жижи\n✅ Электронные устройства\n✅ POD-системы\n✅ Расходники и аксессуары\n\nНаше преимущество: Мы в Оренбурге — это ваш логистический бонус! Быстрая сборка и отправка в день заказа через Почту России или СДЭК.\n\nСайт: ${this.urlWebsite}`;
}

export default new messageBot();
